MUYUCF123/STM32watch01/User/Game_Dino.c
#include "stm32f10x.h"                  // Device header
#include "Game_Dino.h"
#include "OLED_UI.h"
#include <stdlib.h>
#include <math.h>
#include "GeneralKey.h"

int Score;
bool Dino_Flag = false;
uint8_t barrier_flag;
uint8_t Barrier_Pos;
uint16_t Ground_Pos;
uint8_t Cloud_Pos;
uint8_t dino_jump_flag=0;//0:奔跑，1:跳跃
uint8_t Jump_Pos;
extern double pi;
uint16_t jump_t;
struct Object_Position{
	uint8_t minX,minY,maxX,maxY;
};
struct Object_Position barrier;
struct Object_Position dino;
//显示地面，把地面数组中的数据直接写入OLED显存数组中去
void Show_Ground(void)
{
	if(Ground_Pos<128)
	{
			for(uint8_t i=0;i<128;i++)
		{
			OLED_DisplayBuf[7][i]=Ground[i+Ground_Pos];
		}
	}
	else
	{
			for(uint8_t i=0;i<255-Ground_Pos;i++)
		{
			OLED_DisplayBuf[7][i]=Ground[i+Ground_Pos];
		}
			for(uint8_t i=255-Ground_Pos;i<128;i++)
		{
			OLED_DisplayBuf[7][i]=Ground[i-(255-Ground_Pos)];
		}
	}
	
}
//显示分数
void Show_Score(void)
{
	OLED_ShowNum(98,0,Score,5,OLED_6X8_HALF);
}

//显示障碍物
void Show_Barrier(void)
{
	if(Barrier_Pos>=143)
	{
		barrier_flag=rand()%3;//在0，1，2中取随机数
	}
	
	OLED_ShowImage(127-Barrier_Pos,44,16,18,Barrier[barrier_flag]);
	
	barrier.minX=127-Barrier_Pos;
	barrier.maxX=143-Barrier_Pos;
	barrier.minY=44;
	barrier.maxY=62;
}


//显示云朵
void Show_Cloud(void)
{
	OLED_ShowImage(127-Cloud_Pos,9,16,8,Cloud);
}


//显示小恐龙
void Show_Dino(void)
{
	
	if(Key_GetEvent(KEY_UP) ==  KEY_PRESSED )dino_jump_flag=1;
	Jump_Pos=35*sin((float)(pi*jump_t/50));
	
	if(dino_jump_flag==0)
	{
		if(Cloud_Pos%2==0)OLED_ShowImage(0,44,16,18,Dino[0]);
		else OLED_ShowImage(0,44,16,18,Dino[1]);
	}
	
	else
	{
		OLED_ShowImage(0,44-Jump_Pos,16,18,Dino[2]);
	}
	
	dino.minX=0;
	dino.maxX=16;
	dino.minY=44-Jump_Pos;
	dino.maxY=62-Jump_Pos;
}

//碰撞检测函数，传入两个结构体的地址
void isColliding(struct Object_Position *a,struct Object_Position *b)
{
	if((a->maxX>b->minX)&&(a->minX<b->maxX)&&(a->maxY>b->minY)&&(a->minY<b->maxY))
	{
		OLED_Clear();
		OLED_ShowString(28,24,"Game Over",OLED_8X16_HALF);
		OLED_Update();
		Delay_s(1);
		OLED_Clear();
		OLED_Update();
		
	}

}





void Dino_Tick(void){
	static uint8_t Score_Count,Cloud_Count;
	
	
	Ground_Pos++;
	Barrier_Pos++;
	if(Ground_Pos>=256)Ground_Pos=0;
	if(Barrier_Pos>=144)Barrier_Pos=0;
	
	Score_Count++;
	if(Score_Count == 5){
		Score ++;
		Score_Count = 0;
	}
	
	Cloud_Count++;
	if(Cloud_Count == 3){
		Cloud_Pos ++;
		Cloud_Count = 0;
		if(Cloud_Pos>=200)Cloud_Pos=0;
	}
	
	if(dino_jump_flag==1)
	{
		jump_t++;
		if(jump_t>=50)
		{
			jump_t=0;
			dino_jump_flag=0;
		}
	}
	
}

void DinoGameLoop(){
	Show_Score();
	Show_Ground();
	Show_Barrier();
	Show_Cloud();
	Show_Dino();
	isColliding(&dino,&barrier);

}

